zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/include/pic32cx2051bz62064.h
/* ************************************************************************** */
/*              BASE ADDRESS DEFINITIONS FOR PIC32CX2051BZ62064               */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x42001c00)                          /* AC Base Address */
#define ADCHS_BASE_ADDRESS               _UINT32_(0x44001500)                          /* ADCHS Base Address */
#define ARB_BASE_ADDRESS                 _UINT32_(0x41011000)                          /* ARB Base Address */
#define BLE_BASE_ADDRESS                 _UINT32_(0x41012000)                          /* BLE Base Address */
#define BTZBSYS_BASE_ADDRESS             _UINT32_(0x41014000)                          /* BTZBSYS Base Address */
#define CAN0_BASE_ADDRESS                _UINT32_(0x46002000)                          /* CAN0 Base Address */
#define CAN1_BASE_ADDRESS                _UINT32_(0x46002400)                          /* CAN1 Base Address */
#define CCL_BASE_ADDRESS                 _UINT32_(0x42001800)                          /* CCL Base Address */
#define CFG_BASE_ADDRESS                 _UINT32_(0x44000000)                          /* CFG Base Address */
#define CMCC_BASE_ADDRESS                _UINT32_(0x41002000)                          /* CMCC Base Address */
#define CRU_BASE_ADDRESS                 _UINT32_(0x44000a00)                          /* CRU Base Address */
#define CVD_BASE_ADDRESS                 _UINT32_(0x44002400)                          /* CVD Base Address */
#define DAC_CTRL_BASE_ADDRESS            _UINT32_(0x44002e00)                          /* DAC_CTRL Base Address */
#define DMAC_BASE_ADDRESS                _UINT32_(0x41004000)                          /* DMAC Base Address */
#define DMT_BASE_ADDRESS                 _UINT32_(0x44000e00)                          /* DMT Base Address */
#define DSCON_BASE_ADDRESS               _UINT32_(0x42011000)                          /* DSCON Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x41000000)                          /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x40000800)                          /* EIC Base Address */
#define EFUSE_BASE_ADDRESS               _UINT32_(0x00000000)                          /* EFUSE Base Address */
#define ETH_BASE_ADDRESS                 _UINT32_(0x4100a000)                          /* ETH Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x41006000)                          /* EVSYS Base Address */
#define FREQM_BASE_ADDRESS               _UINT32_(0x40000400)                          /* FREQM Base Address */
#define FUSES_DEVICECFG_BASE_ADDRESS     _UINT32_(0x00810e80)                          /* FUSES Base Address */
#define GPIOE_BASE_ADDRESS               _UINT32_(0x44002d00)                          /* GPIOE Base Address */
#define GPIOD_BASE_ADDRESS               _UINT32_(0x44002c00)                          /* GPIOD Base Address */
#define GPIOC_BASE_ADDRESS               _UINT32_(0x44002b00)                          /* GPIOC Base Address */
#define GPIOB_BASE_ADDRESS               _UINT32_(0x44002a00)                          /* GPIOB Base Address */
#define GPIOA_BASE_ADDRESS               _UINT32_(0x44002900)                          /* GPIOA Base Address */
#define HMATRIX2TOP_BASE_ADDRESS         _UINT32_(0x42002400)                          /* HMATRIX2TOP Base Address */
#define NVM_BASE_ADDRESS                 _UINT32_(0x44000600)                          /* NVM Base Address */
#define PAC_BASE_ADDRESS                 _UINT32_(0x40000000)                          /* PAC Base Address */
#define PCHE_BASE_ADDRESS                _UINT32_(0x44012400)                          /* PCHE Base Address */
#define PFW_BASE_ADDRESS                 _UINT32_(0x44000800)                          /* PFW Base Address */
#define PMU_BASE_ADDRESS                 _UINT32_(0x44013e00)                          /* PMU Base Address */
#define PPS_BASE_ADDRESS                 _UINT32_(0x44001000)                          /* PPS Base Address */
#define QEI_BASE_ADDRESS                 _UINT32_(0x44005000)                          /* QEI Base Address */
#define QSPI_BASE_ADDRESS                _UINT32_(0x42000000)                          /* QSPI Base Address */
#define RAMECC_BASE_ADDRESS              _UINT32_(0x41008000)                          /* RAMECC Base Address */
#define RCON_BASE_ADDRESS                _UINT32_(0x44000a00)                          /* RCON Base Address */
#define ROT_BASE_ADDRESS                 _UINT32_(0x44003000)                          /* ROT Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x42010000)                          /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x40000c00)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x40001000)                          /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UINT32_(0x46000000)                          /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UINT32_(0x46000400)                          /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UINT32_(0x46000800)                          /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UINT32_(0x46000c00)                          /* SERCOM5 Base Address */
#define SERCOM6_BASE_ADDRESS             _UINT32_(0x42000400)                          /* SERCOM6 Base Address */
#define SILEX_BASE_ADDRESS               _UINT32_(0x43000000)                          /* SILEX Base Address */
#define TC0_BASE_ADDRESS                 _UINT32_(0x40001400)                          /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UINT32_(0x40001800)                          /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UINT32_(0x40001c00)                          /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UINT32_(0x40002000)                          /* TC3 Base Address */
#define TC4_BASE_ADDRESS                 _UINT32_(0x40002400)                          /* TC4 Base Address */
#define TC5_BASE_ADDRESS                 _UINT32_(0x40002800)                          /* TC5 Base Address */
#define TC6_BASE_ADDRESS                 _UINT32_(0x40002c00)                          /* TC6 Base Address */
#define TC7_BASE_ADDRESS                 _UINT32_(0x40003000)                          /* TC7 Base Address */
#define TC8_BASE_ADDRESS                 _UINT32_(0x46001000)                          /* TC8 Base Address */
#define TC9_BASE_ADDRESS                 _UINT32_(0x46001400)                          /* TC9 Base Address */
#define TCC0_BASE_ADDRESS                _UINT32_(0x40003400)                          /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UINT32_(0x40003800)                          /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UINT32_(0x40003c00)                          /* TCC2 Base Address */
#define USB_BASE_ADDRESS                 _UINT32_(0x44010000)                          /* USB Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x44000500)                          /* WDT Base Address */
#define ZIGBEE_BASE_ADDRESS              _UINT32_(0x41010000)                          /* ZIGBEE Base Address */

/* ************************************************************************** */
/*                   PIO DEFINITIONS FOR PIC32CX2051BZ62064                   */
/* ************************************************************************** */
#include "pio/pic32cx2051bz62064.h"

/* ************************************************************************** */
/*             MEMORY MAPPING DEFINITIONS FOR PIC32CX2051BZ62064              */
/* ************************************************************************** */
#define ROM_SECURE_BOOT_ROM_SIZE       _UINT32_(0x00010000)    /*   64kB Memory segment type: rom */
#define ROM_SECURE_BOOT_PATCH_SIZE     _UINT32_(0x00000800)    /*    2kB Memory segment type: rom */
#define FCR_BFM_SIZE                   _UINT32_(0x00010000)    /*   64kB Memory segment type: flash */
#define FCR_BFM_PAGE_SIZE              _UINT32_(      4096)
#define FCR_BFM_NB_OF_PAGES            _UINT32_(        16)

#define FCR_CFM_SIZE                   _UINT32_(0x00001000)    /*    4kB Memory segment type: fuses */
#define FCR_CFM_PAGE_SIZE              _UINT32_(      4096)
#define FCR_CFM_NB_OF_PAGES            _UINT32_(         1)

